"use strict"
// * Задача 10. Інвестор вклав S тис. грн на 20 років під 20% річних, податок складає 5% від суми прибутку. *
// * Визначити за допомогою циклів суму, яку він одержить.*

if (confirm('Почати тестування?')) {
	let userCash = parseInt(prompt(`Введите сумму, которую Вы хотите вложить на депозит под 20% на 20 лет!`));
	// Посчитано сложным процентом (каждый год клиент реинвестирует свою прибыль)
	for (let i = 1; i <= 20; i++) {
		let userProfit = userCash * 0.2; // прибыль 20%
		let userTaxProfit = userProfit * 0.05; // налог с прибыли 5%
		userCash += (userProfit - userTaxProfit); // Сумма денег за год за вычетом налога
		document.write(`<p>Year:${i}: ${Math.round(userCash)}грн</p>`);
	}
	document.write(`<p>Через 20 лет Вы получите ${Math.round(userCash)}грн! - С учетом налога 5%!</p>`);
}
