"use strict"
// * Задача 11. Користувач загадує число. За 3 спроби комп’ютер намагається вгадати число користувача (використати confirm). *

if (confirm('Почати тестування?')) {

	alert("Загадайте число от 0 до 10, а я попробую его угадать с трех попыток");

	for (let i = 1; i <= 3; i++) {
		let randomNumber = Math.floor(Math.random() * 11);
		if (confirm(`Ваше число ${randomNumber} ?`)) {
			document.write(`Ура! Я угадал :) Вы загадали ${randomNumber} ! Спасибо за игру!`);
			break;
		} else if (i===3) {
			document.write(`К сожалению я не смог угадать Ваше число :( Спасибо за игру!`)
		}
	}
}