"use strict"
// * Задача 17. Каса. Користувачу повідомляють суму, яку йому треба сплатити. *
// * Користувач поступово вводить суму грошей до тих пір, поки суми не буде достатньо для оплати товарів *
// * (кожного разу користувачу повідомляють, яку ще суму потрібно ввести). *

if (confirm('Почати тестування?')) {
	let itemPrice = 500;
	alert(`Вам нужно заплатить за телевизор ${itemPrice} грн. Введите постепенно купюры.`);


	for (let i = 1; i ; i ++) {
		let userMoney = parseInt(prompt(`Введите номинал купюры`));
		if (userMoney < itemPrice) { 
			alert(`Вам нехватает еще ${itemPrice - userMoney}`);
			itemPrice -= userMoney;
		} else {
			alert(`Спасибо за покупку!`);
			break;
		}
	}
}