"use strict"
// * Задача 2.	З клавіатури вводиться ціна товару і кількість грошей. *
// * Якщо грошей не вистачає то відмовляємо у покупці, інакше, якщо ще залишаються гроші, то пропонуємо купити лотерею за 4 грн. *
// Шаг 0 - Обозначение
// имя первого ребенка - firstChildrenName
// имя второго ребенка - secondChildrenName
// количесвто конфет у первого ребенка - firstChildrenCandyValue
// количесвто конфет у второго ребенка - secondChildrenCandyValue

// Шаг 1 - Вводим необходимые значения
let itemPrice = parseFloat(prompt(`Введите стоимость товара`));
let moneyCount = parseFloat(prompt(`Введите сколько у вас денег`));

// Шаг 2 - Розв"язок заадачі
//если женег не хватает то отказываем в покупке, если остаток от деления больше 4 то предлагаем купить лотерею в другом случае
//пишем что вы можете купить этот товар.
if (moneyCount < itemPrice)
	document.write(`<p class="block">К сожалению у вас не достаточно средств для покупки</p>`)
else if ((moneyCount % itemPrice) >= 4)
	document.write(`<p class="block">Поздравляем, Вы можете купить этот товар и еще Вам хватит купить лотерею за 4 грн.</p>`)
else document.write(`<p class="block">Поздравляем, Вы можете купить этот товар.</p>`)



